app/views/websites/random.html.erb

<% #Selects random website from database %>
<% @website = Website.offset(rand(Website.count)).first %>
---
SELECT  "websites".* FROM "websites"  ORDER BY "websites"."id" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "websites"