app/controllers/websites_controller.rb

SELECT "websites".* FROM "websites"
---
  def index
    @websites = Website.all

INSERT INTO "websites" ("name", "description", "address", "sudo_address", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @website = Website.new(website_params)

    respond_to do |format|
      if @website.save

UPDATE "websites" SET "image_file_name" = $1, "image_content_type" = $2, "image_file_size" = $3, "image_updated_at" = $4, "updated_at" = $5 WHERE "websites"."id" = $6
---
  def update
    respond_to do |format|
      if @website.update(website_params)

SELECT  "websites".* FROM "websites" WHERE "websites"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_website
      @website = Website.find(params[:id])